export type Point = google.maps.LatLngLiteral & {
  type:
    | ''
    | 'cave'
    | 'fortress'
    | 'historical'
    | 'lighthouse'
    | 'monument'
    | 'natural'
    | 'old_town'
    | 'ruin';
  title: string;
};

export const points: Point[] = [
  {
    lat: 42.275133659000936,
    lng: 18.826982975006104,
    type: 'fortress',
    title: 'Руины австрийской крепости Могрен',
  },
  {
    lat: 42.27860666307504,
    lng: 18.836129307746887,
    type: 'ruin',
    title: 'Древнеримский некропль',
  },
  {
    lat: 42.294409390923214,
    lng: 18.87403428554535,
    type: 'natural',
    title: 'Древняя олива',
  },
  {
    lat: 42.293835245820986,
    lng: 18.875591026300892,
    type: 'ruin',
    title: 'Развалины мельницы',
  },
  {
    lat: 42.292574304900405,
    lng: 18.87504913460358,
    type: 'cave',
    title: 'Пещера Ивановичи',
  },
  {
    lat: 42.27712926575511,
    lng: 18.838263198862933,
    type: 'fortress',
    title: 'Будва: цитадель',
  },
  {
    lat: 42.27815022203572,
    lng: 18.837636709213257,
    type: 'old_town',
    title: 'Будва: старый город',
  },
  {
    lat: 42.27125921448397,
    lng: 18.846744833369705,
    type: 'historical',
    title: 'Часовня крестоносцев',
  },
  {
    lat: 42.287052571960125,
    lng: 18.885689892322766,
    type: 'natural',
    title: 'Водопад',
  },
  {
    lat: 42.42118354844844,
    lng: 18.749308432526366,
    type: 'fortress',
    title: 'Форт Врмац',
  },
  {
    lat: 42.29803761094782,
    lng: 18.844456806203493,
    type: 'historical',
    title: 'Монастырь Подмаине',
  },
  {
    lat: 42.297946797761924,
    lng: 18.84341023914012,
    type: 'historical',
    title: 'Старинный мост',
  },
  {
    lat: 42.255955333280376,
    lng: 18.891446962014257,
    type: 'old_town',
    title: 'Свети-Стефан',
  },
  {
    lat: 42.39580006812814,
    lng: 18.764165868455795,
    type: 'fortress',
    title: 'Форт Горажда',
  },
  {
    lat: 42.403142859039846,
    lng: 18.762486468098057,
    type: 'fortress',
    title: 'Форт Троица',
  },
  {
    lat: 42.39074914393358,
    lng: 18.711776919687182,
    type: 'natural',
    title: 'Тиватская Солила',
  },
  {
    lat: 42.2052360221782,
    lng: 18.9371158182621,
    type: 'fortress',
    title: 'Крепость Кастио',
  },
  {
    lat: 42.13712533225962,
    lng: 19.043902330881547,
    type: 'fortress',
    title: 'Крепость Табия',
  },
  {
    lat: 42.15039215436781,
    lng: 19.031547706428505,
    type: 'fortress',
    title: 'Крепость Хай-Нехай',
  },
  {
    lat: 42.46789412201348,
    lng: 19.266767864055097,
    type: 'ruin',
    title: 'Руины Диоклеи',
  },
  {
    lat: 42.24422638563624,
    lng: 19.09294394288587,
    type: 'fortress',
    title: 'Крепость Бесац',
  },
  {
    lat: 42.24619402714383,
    lng: 19.091258949410722,
    type: 'historical',
    title: 'Старинный мост',
  },
  {
    lat: 42.24640438189973,
    lng: 19.090697453038924,
    type: 'old_town',
    title: 'Вирпазар',
  },
  {
    lat: 42.3938008811846,
    lng: 19.141599125333922,
    type: 'monument',
    title: 'Барутана',
  },
  {
    lat: 42.42037183870199,
    lng: 18.550161999504393,
    type: 'fortress',
    title: 'Форт Кабала',
  },
  {
    lat: 42.42735832676654,
    lng: 18.556442581944513,
    type: 'old_town',
    title: 'Росе',
  },
  {
    lat: 42.4286327060343,
    lng: 18.556340658001947,
    type: 'fortress',
    title: 'Форт Росе',
  },
  {
    lat: 42.51378269755718,
    lng: 18.681551579394878,
    type: 'natural',
    title: 'Водопад Сопот',
  },
  {
    lat: 42.36710394637622,
    lng: 18.953089730534305,
    type: 'natural',
    title: 'Липская пещера',
  },
  {
    lat: 42.094208602985994,
    lng: 19.1348991174308,
    type: 'ruin',
    title: 'Старый Бар',
  },
  {
    lat: 42.094140467135325,
    lng: 19.136201264742816,
    type: 'historical',
    title: 'Акведук',
  },
  {
    lat: 42.422141816711076,
    lng: 18.774840831756592,
    type: 'fortress',
    title: 'Котор: крепость Святого Иоанна',
  },
  {
    lat: 42.42484107773738,
    lng: 18.769734720940864,
    type: 'old_town',
    title: 'Котор: старый город',
  },
  {
    lat: 42.42239174099881,
    lng: 18.77593567526932,
    type: 'ruin',
    title: 'Руины деревни и часовня',
  },
  {
    lat: 42.43607347565511,
    lng: 18.764200508594513,
    type: 'natural',
    title: 'Которский океанариум',
  },
  {
    lat: 42.10087726917829,
    lng: 19.091084003448486,
    type: 'ruin',
    title: 'Курган бронзового века',
  },
  {
    lat: 42.100676095855995,
    lng: 19.091215032832988,
    type: 'historical',
    title: 'Дворец Короля Николы',
  },
  {
    lat: 42.10078754208998,
    lng: 19.091746110217937,
    type: 'natural',
    title: 'Дворцовый парк',
  },
  {
    lat: 41.92524501781725,
    lng: 19.201881265020248,
    type: 'old_town',
    title: 'Ульцинь: старый город',
  },
  {
    lat: 41.924021333862484,
    lng: 19.205785989761353,
    type: 'monument',
    title: 'Монумент свободы',
  },
  {
    lat: 41.95262753306175,
    lng: 19.149699097352958,
    type: 'lighthouse',
    title: 'Маяк Мендра',
  },
  {
    lat: 42.27751730160111,
    lng: 18.835078033083207,
    type: 'monument',
    title: 'Статуя балерины',
  },
  {
    lat: 42.28611186037201,
    lng: 18.822779970220854,
    type: 'natural',
    title: 'Парк природы «Спас»',
  },
  {
    lat: 42.399914442570854,
    lng: 18.8375186920166,
    type: 'monument',
    title: 'Мавзолей Негуша',
  },
  {
    lat: 42.40067480734931,
    lng: 18.837052238037078,
    type: 'monument',
    title: 'Смотровая площадка',
  },
];
